eziya/STM32_SECURITY_LAB/STM32CubeExpansion_SBSFU_V2.7.0/Projects/NUCLEO-H753ZI/Applications/2_Images_OSC/2_Images_SBSFU/SBSFU/Target/sfu_low_level_security.c
  e_ret_status = SFU_SUCCESS;

  return e_ret_status;
}
#endif /*SFU_CLCK_MNTR_PROTECT_ENABLE*/

#ifdef SFU_TEMP_MNTR_PROTECT_ENABLE
/**
  * @brief  Apply TEMP MONITOR protection
  * @note   This function has been added just as template to be used/customized
  *         if a temperature monitor is requested.
  * @param  None
  * @retval SFU_ErrorStatus SFU_SUCCESS if successful, SFU_ERROR otherwise.
  */
SFU_ErrorStatus SFU_LL_SECU_SetProtectionTEMP_MONITOR(void)
{
  SFU_ErrorStatus e_ret_status = SFU_ERROR;

  /* Apply the Temperature Monitoring */
  /* Add your code here for customization
     ...
     ...
  */

  e_ret_status = SFU_SUCCESS;

  return e_ret_status;
}
#endif /*SFU_TEMP_MNTR_PROTECT_ENABLE*/

#ifdef SFU_PCROP_PROTECT_ENABLE
/**
  * @brief  Check PCROP protection.
  * @param  psFlashOptionBytes: pointer to the Option Bytes structure.
  * @retval SFU_ErrorStatus SFU_SUCCESS if successful, SFU_ERROR otherwise.
  */
SFU_ErrorStatus SFU_LL_SECU_CheckProtectionPCROP(FLASH_OBProgramInitTypeDef *psFlashOptionBytes)
{
  SFU_ErrorStatus e_ret_status = SFU_ERROR;

  /* Check/Apply PCRoP ********************************************************/
  /* Check if area is already included in a PCROP region */
  /* On H7 size of PCROP = [(PROT_AREA_END - PROT_AREA_START) + 1] x 256 */
  if ((psFlashOptionBytes->PCROPStartAddr <= SFU_PROTECT_PCROP_ADDR_START)
      && (psFlashOptionBytes->PCROPEndAddr >= (SFU_PROTECT_PCROP_ADDR_END - 0xFFU)))
  {
    if ((psFlashOptionBytes->PCROPConfig & OB_PCROP_RDP_ERASE) == OB_PCROP_RDP_ERASE)
    {
      e_ret_status = SFU_SUCCESS;
    }
  }

  if (e_ret_status == SFU_SUCCESS)
  {
    /* Execution stopped if flow control failed */
    FLOW_CONTROL_STEP(uFlowProtectValue, FLOW_STEP_PCROP, FLOW_CTRL_PCROP);
  }
  return e_ret_status;
}

/**
  * @brief  Apply PCROP protection.
  * @param  psFlashOptionBytes: pointer to the Option Bytes structure.
  * @param  pbIsProtectionToBeApplied: Output parameter to be set as "TRUE" if
  *         this OptByte has to be modified and immediately reloaded.
  * @retval SFU_ErrorStatus SFU_SUCCESS if successful, SFU_ERROR otherwise.
  */
SFU_ErrorStatus SFU_LL_SECU_SetProtectionPCROP(FLASH_OBProgramInitTypeDef *psFlashOptionBytes,
                                               SFU_BoolTypeDef *pbIsProtectionToBeApplied)
{
  SFU_ErrorStatus e_ret_status = SFU_ERROR;

  /* Check/Apply PCRoP ********************************************************/

  /* Check if area is already included in a PCROP region */
  if (SFU_LL_SECU_CheckProtectionPCROP(psFlashOptionBytes) == SFU_SUCCESS)
  {
    e_ret_status = SFU_SUCCESS;
  }
  else
  {
#if defined(SECBOOT_OB_DEV_MODE)
    /* Update OB for PCROP */
    psFlashOptionBytes->OptionType = OPTIONBYTE_PCROP;

    /*
     * Warning: on H7 the minimum PCROP size (512 bytes) is bigger than L4 => adjust the memory mapping accordingly
     */
    psFlashOptionBytes->Banks = SFU_PROTECT_PCROP_AREA;                            /* Bank1 */
    psFlashOptionBytes->PCROPConfig = OB_PCROP_RDP_ERASE;                          /* erase PCROP when doing a
                                                                                      RDP-level regression (1->0) */
    psFlashOptionBytes->PCROPStartAddr = SFU_PROTECT_PCROP_ADDR_START;
    psFlashOptionBytes->PCROPEndAddr = SFU_PROTECT_PCROP_ADDR_END;

    if (HAL_FLASHEx_OBProgram(psFlashOptionBytes) == HAL_OK)
    {
      *pbIsProtectionToBeApplied |= 1U;
      e_ret_status = SFU_SUCCESS;
      /* Execution stopped if flow control failed */
      FLOW_CONTROL_STEP(uFlowProtectValue, FLOW_STEP_PCROP, FLOW_CTRL_PCROP);
    }
#else
    TRACE("\r\n= [SBOOT] System Security Configuration failed: incorrect PCROP. STOP!");
    /* Security issue : execution stopped ! */
    SFU_EXCPT_Security_Error();
#endif /* SECBOOT_OB_DEV_MODE */
  }

  return e_ret_status;
}
#endif /*SFU_PCROP_PROTECT_ENABLE*/

#ifdef  SFU_SECURE_USER_PROTECT_ENABLE
/**
  * @brief  Check Secure User Memory protection configuration.
  * @param  psFlashOptionBytes: pointer to the Option Bytes structure.
  * @retval SFU_ErrorStatus SFU_SUCCESS if successful, SFU_ERROR otherwise.
  */
SFU_ErrorStatus SFU_LL_SECU_CheckProtectionSecUser(FLASH_OBProgramInitTypeDef *psFlashOptionBytes)
{
  SFU_ErrorStatus e_ret_status = SFU_ERROR;

  /* Test if Secure Bit is set.
   * Secure access mode on the device is configured through the SECURITY option bit in FLASH_OPTSR_CUR register.
   */
  if ((psFlashOptionBytes->USERConfig & FLASH_OPTSR_SECURITY) != RESET)
  {
    if ((psFlashOptionBytes->SecureAreaStartAddr == SFU_SEC_USER_MEM_START_FROM_OB) &&
        (psFlashOptionBytes->SecureAreaEndAddr == SFU_SEC_USER_MEM_END_FROM_OB))
    {
      /*
       * In this example we use one secure area in bank 1, covering:
       * - the SB_SFU code
       * - the header of the active slots
       */
#if defined(SFU_VERBOSE_DEBUG_MODE)
      TRACE("\r\n= [SBOOT] Secure User memory Area settings: [%x-%x]", psFlashOptionBytes->SecureAreaStartAddr,
            ((uint32_t)(psFlashOptionBytes->SecureAreaEndAddr | 0x000000FFU)));
#endif /* SFU_VERBOSE_DEBUG_MODE */
      e_ret_status = SFU_SUCCESS;
      /* Execution stopped if flow control failed */
      FLOW_CONTROL_STEP(uFlowProtectValue, FLOW_STEP_SEC_MEM, FLOW_CTRL_SEC_MEM);
    }
    else
    {
      /* else the settings are incorrect: ERROR */
      TRACE("\r\n= [SBOOT] Incorrect Secure User memory Area settings - s:%x e:%x !",
            psFlashOptionBytes->SecureAreaStartAddr,     psFlashOptionBytes->SecureAreaEndAddr);
    }
  }
  else
  {
    /*
     * Else: ERROR
     *    Secure Bit Not Set.
     *    If this bit is not set then Secure User Software cannot run.
     *    In this example this means that SB_SFU would be bypassed.
     */
    TRACE("\r\n= [SBOOT] SECURITY bit not set !");
  }

  return e_ret_status;
}

/**
  * @brief  Apply Secure User Memory protection.
  * @param  psFlashOptionBytes: pointer to the Option Bytes structure.
  * @param  pbIsProtectionToBeApplied: Output parameter to be set as "TRUE" if
  *         this OptByte has to be modified and immediately reloaded.
  * @retval SFU_ErrorStatus SFU_SUCCESS if successful, SFU_ERROR otherwise.
  */
SFU_ErrorStatus SFU_LL_SECU_SetProtectionSecUser(FLASH_OBProgramInitTypeDef *psFlashOptionBytes,
                                                 SFU_BoolTypeDef *pbIsProtectionToBeApplied)
{
  SFU_ErrorStatus e_ret_status = SFU_ERROR;
  SFU_LL_RSS_SecureArea_t aSecureAreas[SFU_LL_RSS_NB_SECURE_AREAS];

