eziya/STM32_SECURITY_LAB/STM32CubeExpansion_SBSFU_V2.7.0/Projects/NUCLEO-H753ZI/Applications/2_Images_OSC/2_Images_SBSFU/SBSFU/Target/sfu_low_level_security.c
  /* Check if Secure User Memory is already configured */
  if (SFU_LL_SECU_CheckProtectionSecUser(psFlashOptionBytes) == SFU_SUCCESS)
  {
    e_ret_status = SFU_SUCCESS;
  }
  else
  {
    /* Apply the proper configuration if we are in development mode */
#if defined(SECBOOT_OB_DEV_MODE)
    /* Set the security bit if needed */
    /* ------------------------------ */
    if ((psFlashOptionBytes->USERConfig & FLASH_OPTSR_SECURITY) == RESET)
    {
      psFlashOptionBytes->Banks = FLASH_BANK_1;
      psFlashOptionBytes->OptionType = OPTIONBYTE_USER;
      psFlashOptionBytes->USERType = OB_USER_SECURITY;
      psFlashOptionBytes->USERConfig = OB_SECURITY_ENABLE;

      if (HAL_FLASHEx_OBProgram(psFlashOptionBytes) == HAL_OK)
      {
        TRACE("\r\n\t Security bit set.");
        /*
          * We need to reload the OBs before configuring the secure user memory area,
          * otherwise the configuration is skipped because Secure Mode is not entered at reset (not booting in RSS).
          *
          * Note: updating pbIsProtectionToBeApplied and e_ret_status would be useless here.
          */
        HAL_FLASH_OB_Launch();
      }
      else
      {
#if defined(SFU_VERBOSE_DEBUG_MODE)
        TRACE("\r\n\t Cannot set the security bit - ERROR");
#endif /* SFU_VERBOSE_DEBUG_MODE */
        return (SFU_ERROR);
      }
    }
    /* else only the secure user memory area needs to be set */

    /* Set the secure user memory area */
    /* ------------------------------- */
    aSecureAreas[0].sizeInBytes = SFU_SEC_USER_MEM_SIZE;
    aSecureAreas[0].startAddress = SFU_SEC_USER_MEM_START_FROM_OB;
    aSecureAreas[0].removeDuringBankErase = 1U;
    /* Only 1 secure area is used */
    aSecureAreas[1].sizeInBytes = 0U;
    aSecureAreas[1].startAddress = 0U;
    aSecureAreas[1].removeDuringBankErase = 1U;

    TRACE("\r\n= [SBOOT] SecArea.size: %d SecArea.addr:%x - RESET", aSecureAreas[0].sizeInBytes,
          aSecureAreas[0].startAddress);

    /* no need to set pbIsProtectionToBeApplied and e_ret_status because the next function triggers a RESET */
    SFU_LL_RSS->resetAndInitializeSecureAreas(1, aSecureAreas);

#else
    TRACE("\r\n= [SBOOT] System Security Configuration failed: Secure User Memory is incorrect. STOP!");
    SFU_EXCPT_Security_Error();
#endif /* SECBOOT_OB_DEV_MODE */
  }

  return e_ret_status;
}
#endif /* SFU_SECURE_USER_PROTECT_ENABLE */

/**
  * @brief  Activate Secure User Memory protection and jump into user application.
  * @param  Address of the code to jump into
  * @retval none.
  */

/* Place code in a specific section and remove specific warning */
#if defined(__ICCARM__)
#pragma diag_suppress=TA022
#pragma diag_suppress=TA023
#elif defined(__CC_ARM)
#pragma arm section code = ".SB_HDP_Code"
#elif defined(__ARMCC_VERSION)
__attribute__((section(".SB_HDP_Code")))
#endif /* __ICCARM__ */

__RAM_FUNC void SFU_LL_SECU_ActivateSecUser(uint32_t Address)
{
  /* Unlock the Flash to enable the flash control register access */
  (void) HAL_FLASH_Unlock();

#if defined(SFU_SECURE_USER_PROTECT_ENABLE)
  /* Ensure all actions are completed before activating secure user memory */
  __ISB();
#define SEC_CONFSEC_USER ((uint32_t)0x00000002U) /*!< User Secure mode*/
#define SEC_BASE_ADDRESS 0x4FFF1000U
#define SEC ((SEC_TypeDef *) SEC_BASE_ADDRESS)
  typedef struct
  {
    __IO uint32_t CONFSEC; /*!< Security Configuration Register Address offset: 0x00 */
  } SEC_TypeDef;
  /* Secure coding  : volatile variable usage to force compiler to reload SEC->CONFSEC register address */
  __IO uint32_t read_reg = (uint32_t) &SEC->CONFSEC;

  do
  {
    /* Activate secure user memory */
    SEC->CONFSEC &= ~SEC_CONFSEC_USER;
  } while (((* (uint32_t *)read_reg) & SEC_CONFSEC_USER) == SEC_CONFSEC_USER);


  if (((* (uint32_t *)read_reg) & SEC_CONFSEC_USER) == SEC_CONFSEC_USER)
  {
    /* Security issue : execution stopped ! */
    NVIC_SystemReset();
  }
  else
  {
    __DSB();
#else
  if (1 == 1)
  {
#endif /* (SFU_SECURE_USER_PROTECT_ENABLE) */
#if defined(SFU_MPU_PROTECT_ENABLE)
    /* Make sure outstanding transfers are done */
    __DMB();

    /* Disable the MPU and clear the control register*/
    MPU->CTRL  = 0U;

#if (SECBOOT_LOADER == SECBOOT_USE_LOCAL_LOADER) || defined(SFU_DEBUG_MODE) || defined(SFU_TEST_PROTECTION)
    /* Disable the UART. This may be done only after the MPU is disabled */
    /* Use of macro that manipulate register instead of function call since secure user memory is activated */
    SFU_UART_CLK_DISABLE();
#endif /* (SECBOOT_LOADER == SECBOOT_USE_LOCAL_LOADER) || defined(SFU_DEBUG_MODE) || defined(SFU_TEST_PROTECTION) */
#endif /* SFU_MPU_PROTECT_ENABLE */

#if (__FPU_PRESENT == 1) && (__FPU_USED == 1)
    /* Reset FPU context */
    SCB->CPACR &= ~((3UL << 10*2)|(3UL << 11*2));  /* reset CP10 and CP11 Full Access */
    FPU->FPCCR &= ~FPU_FPCCR_LSPEN_Msk; /* Disable automatic lazy state preservation for floating-point context */
    FPU->FPCCR &= ~FPU_FPCCR_LSPACT_Msk; /* Clear the lazy state preservation for floating-point context */
#endif /* (__FPU_PRESENT == 1) && (__FPU_USED == 1) */

    /* clear process stack & unprivileged bit */
    __set_CONTROL(__get_CONTROL() & ~0x3U);

    /* returns from interrupt into application */
    launch_application(Address, (uint32_t)jump_to_function);
  }

  /*we should never reach this point */
  NVIC_SystemReset();
}

#if defined(__CC_ARM)
#pragma arm section code
#endif /* __CC_ARM */

